Updated README to include mermaid charts
